#+TITLE: Statistical Analysis using R
#+AUTHOR: Anshul Gupta
#+EMAIL: [[mailto:anshulgupta0803@gmail.com][anshulgupta0803@gmail.com]]
#+STARTUP: overview
#+STARTUP: indent

** Mean Averages
#+BEGIN_SRC R :results output :session comm.4b.ratio.td.ti :exports both
mean.avg<-matrix(0, 5, 5)
mean.avg[1,]<-c(mean(dI_I$ratioavg), mean(dI_II$ratioavg), mean(dI_III$ratioavg), mean(dI_IV$ratioavg), mean(dI_V$ratioavg))
mean.avg[2,]<-c(mean(dII_I$ratioavg), mean(dII_II$ratioavg), mean(dII_III$ratioavg), mean(dII_IV$ratioavg), mean(dII_V$ratioavg))
mean.avg[3,]<-c(mean(dIII_I$ratioavg), mean(dIII_II$ratioavg), mean(dIII_III$ratioavg), mean(dIII_IV$ratioavg), mean(dIII_V$ratioavg))
mean.avg[4,]<-c(mean(dIV_I$ratioavg), mean(dIV_II$ratioavg), mean(dIV_III$ratioavg), mean(dIV_IV$ratioavg), mean(dIV_V$ratioavg))
mean.avg[5,]<-c(mean(dV_I$ratioavg), mean(dV_II$ratioavg), mean(dV_III$ratioavg), mean(dV_IV$ratioavg), mean(dV_V$ratioavg))
print(mean.avg)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 0.7495389 0.7148496 1.0342408 0.7459249 0.9805636
: [2,] 0.7771679 0.7031781 1.0158230 0.7104106 0.9503621
: [3,] 0.7198316 0.6881710 1.0000000 0.7031072 0.9191043
: [4,] 0.7766260 0.6902595 1.0261407 0.7200809 0.9208353
: [5,] 0.7193860 0.6798221 0.9880754 0.7057117 0.8670206

** Mean Mins
#+BEGIN_SRC R :results output :session comm.4b.ratio.td.ti :exports both
mean.min<-matrix(0, 5, 5)
mean.min[1,]<-c(mean(dI_I$ratiomin), mean(dI_II$ratiomin), mean(dI_III$ratiomin), mean(dI_IV$ratiomin), mean(dI_V$ratiomin))
mean.min[2,]<-c(mean(dII_I$ratiomin), mean(dII_II$ratiomin), mean(dII_III$ratiomin), mean(dII_IV$ratiomin), mean(dII_V$ratiomin))
mean.min[3,]<-c(mean(dIII_I$ratiomin), mean(dIII_II$ratiomin), mean(dIII_III$ratiomin), mean(dIII_IV$ratiomin), mean(dIII_V$ratiomin))
mean.min[4,]<-c(mean(dIV_I$ratiomin), mean(dIV_II$ratiomin), mean(dIV_III$ratiomin), mean(dIV_IV$ratiomin), mean(dIV_V$ratiomin))
mean.min[5,]<-c(mean(dV_I$ratiomin), mean(dV_II$ratiomin), mean(dV_III$ratiomin), mean(dV_IV$ratiomin), mean(dV_V$ratiomin))
print(mean.min)
#+END_SRC

#+RESULTS:
:          [,1]     [,2] [,3]     [,4]      [,5]
: [1,] 1.108328 1.362207  NaN 1.118130 0.9657259
: [2,] 1.223807 1.488171  NaN 1.216092 0.8990169
: [3,] 1.188552 1.443744  NaN 1.196724 0.9575741
: [4,] 1.123897 1.355129  NaN 1.127264 0.9172106
: [5,] 1.198961 1.451248  NaN 1.209938 0.9992939

** Mean Maxs
#+BEGIN_SRC R :results output :session comm.4b.ratio.td.ti :exports both
mean.max<-matrix(0, 5, 5)
mean.max[1,]<-c(mean(dI_I$ratiomax), mean(dI_II$ratiomax), mean(dI_III$ratiomax), mean(dI_IV$ratiomax), mean(dI_V$ratiomax))
mean.max[2,]<-c(mean(dII_I$ratiomax), mean(dII_II$ratiomax), mean(dII_III$ratiomax), mean(dII_IV$ratiomax), mean(dII_V$ratiomax))
mean.max[3,]<-c(mean(dIII_I$ratiomax), mean(dIII_II$ratiomax), mean(dIII_III$ratiomax), mean(dIII_IV$ratiomax), mean(dIII_V$ratiomax))
mean.max[4,]<-c(mean(dIV_I$ratiomax), mean(dIV_II$ratiomax), mean(dIV_III$ratiomax), mean(dIV_IV$ratiomax), mean(dIV_V$ratiomax))
mean.max[5,]<-c(mean(dV_I$ratiomax), mean(dV_II$ratiomax), mean(dV_III$ratiomax), mean(dV_IV$ratiomax), mean(dV_V$ratiomax))
print(mean.max)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]     [,3]      [,4]     [,5]
: [1,] 0.7868566 0.7567056 1.149522 0.7194873 1.662842
: [2,] 0.8339478 0.7568601 1.207191 0.7098592 1.578807
: [3,] 0.7185902 0.6918116 1.000000 0.6637959 1.528781
: [4,] 0.8124803 0.7053302 1.121275 0.6810224 1.566124
: [5,] 0.6999034 0.6570043 1.026403 0.6409676 1.375243

** Mean Averages
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.avg<-matrix(0, 5, 5)
mean.avg[1,]<-c(mean(dI_I$ratioavg), mean(dI_II$ratioavg), mean(dI_III$ratioavg), mean(dI_IV$ratioavg), mean(dI_V$ratioavg))
mean.avg[2,]<-c(mean(dII_I$ratioavg), mean(dII_II$ratioavg), mean(dII_III$ratioavg), mean(dII_IV$ratioavg), mean(dII_V$ratioavg))
mean.avg[3,]<-c(mean(dIII_I$ratioavg), mean(dIII_II$ratioavg), mean(dIII_III$ratioavg), mean(dIII_IV$ratioavg), mean(dIII_V$ratioavg))
mean.avg[4,]<-c(mean(dIV_I$ratioavg), mean(dIV_II$ratioavg), mean(dIV_III$ratioavg), mean(dIV_IV$ratioavg), mean(dIV_V$ratioavg))
mean.avg[5,]<-c(mean(dV_I$ratioavg), mean(dV_II$ratioavg), mean(dV_III$ratioavg), mean(dV_IV$ratioavg), mean(dV_V$ratioavg))
print(mean.avg)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]     [,3]      [,4]      [,5]
: [1,] 1.0000000 0.9984286 1.005314 0.9984847 1.0001570
: [2,] 1.0045386 1.0000000 1.009260 1.0017329 1.0035174
: [3,] 0.9974095 0.9952806 1.000000 0.9944277 0.9950813
: [4,] 1.0139975 1.0108054 1.017677 1.0000000 1.0105457
: [5,] 1.0054752 1.0025272 1.008553 1.0008474 1.0000000

** Mean Mins
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.min<-matrix(0, 5, 5)
mean.min[1,]<-c(mean(dI_I$ratiomin), mean(dI_II$ratiomin), mean(dI_III$ratiomin), mean(dI_IV$ratiomin), mean(dI_V$ratiomin))
mean.min[2,]<-c(mean(dII_I$ratiomin), mean(dII_II$ratiomin), mean(dII_III$ratiomin), mean(dII_IV$ratiomin), mean(dII_V$ratiomin))
mean.min[3,]<-c(mean(dIII_I$ratiomin), mean(dIII_II$ratiomin), mean(dIII_III$ratiomin), mean(dIII_IV$ratiomin), mean(dIII_V$ratiomin))
mean.min[4,]<-c(mean(dIV_I$ratiomin), mean(dIV_II$ratiomin), mean(dIV_III$ratiomin), mean(dIV_IV$ratiomin), mean(dIV_V$ratiomin))
mean.min[5,]<-c(mean(dV_I$ratiomin), mean(dV_II$ratiomin), mean(dV_III$ratiomin), mean(dV_IV$ratiomin), mean(dV_V$ratiomin))
print(mean.min)
#+END_SRC

#+RESULTS:
:          [,1]     [,2]     [,3]      [,4]      [,5]
: [1,] 1.000000 1.001791 1.002766 0.9956147 1.0006442
: [2,] 1.002000 1.000000 1.003561 0.9955510 1.0002064
: [3,] 1.000441 1.001023 1.000000 0.9938471 0.9991322
: [4,] 1.016324 1.015903 1.016734 1.0000000 1.0138514
: [5,] 1.004893 1.004167 1.005782 0.9975405 1.0000000

** Mean Maxs
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.max<-matrix(0, 5, 5)
mean.max[1,]<-c(mean(dI_I$ratiomax), mean(dI_II$ratiomax), mean(dI_III$ratiomax), mean(dI_IV$ratiomax), mean(dI_V$ratiomax))
mean.max[2,]<-c(mean(dII_I$ratiomax), mean(dII_II$ratiomax), mean(dII_III$ratiomax), mean(dII_IV$ratiomax), mean(dII_V$ratiomax))
mean.max[3,]<-c(mean(dIII_I$ratiomax), mean(dIII_II$ratiomax), mean(dIII_III$ratiomax), mean(dIII_IV$ratiomax), mean(dIII_V$ratiomax))
mean.max[4,]<-c(mean(dIV_I$ratiomax), mean(dIV_II$ratiomax), mean(dIV_III$ratiomax), mean(dIV_IV$ratiomax), mean(dIV_V$ratiomax))
mean.max[5,]<-c(mean(dV_I$ratiomax), mean(dV_II$ratiomax), mean(dV_III$ratiomax), mean(dV_IV$ratiomax), mean(dV_V$ratiomax))
print(mean.max)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]     [,3]     [,4]      [,5]
: [1,] 1.0000000 1.0086859 1.066964 1.051551 1.0315148
: [2,] 1.0298134 1.0000000 1.078150 1.070226 1.0397819
: [3,] 0.9893656 0.9809011 1.000000 1.025979 0.9871245
: [4,] 1.0039507 1.0002140 1.046869 1.000000 1.0076254
: [5,] 1.0394037 1.0236284 1.059869 1.070998 1.0000000

** Mean Averages
#+BEGIN_SRC R :results output :session comp.4b.ratio.td.tic :exports both
mean.avg<-matrix(0, 5, 5)
mean.avg[1,]<-c(mean(dI_I$ratioavg), mean(dI_II$ratioavg), mean(dI_III$ratioavg), mean(dI_IV$ratioavg), mean(dI_V$ratioavg))
mean.avg[2,]<-c(mean(dII_I$ratioavg), mean(dII_II$ratioavg), mean(dII_III$ratioavg), mean(dII_IV$ratioavg), mean(dII_V$ratioavg))
mean.avg[3,]<-c(mean(dIII_I$ratioavg), mean(dIII_II$ratioavg), mean(dIII_III$ratioavg), mean(dIII_IV$ratioavg), mean(dIII_V$ratioavg))
mean.avg[4,]<-c(mean(dIV_I$ratioavg), mean(dIV_II$ratioavg), mean(dIV_III$ratioavg), mean(dIV_IV$ratioavg), mean(dIV_V$ratioavg))
mean.avg[5,]<-c(mean(dV_I$ratioavg), mean(dV_II$ratioavg), mean(dV_III$ratioavg), mean(dV_IV$ratioavg), mean(dV_V$ratioavg))
print(mean.avg)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 0.8712654 0.8769590 0.8788809 0.8783247 0.8762274
: [2,] 0.8724207 0.8778666 0.8797489 0.8795243 0.8773196
: [3,] 0.8672520 0.8727927 0.8745157 0.8740932 0.8719821
: [4,] 0.8754578 0.8817545 0.8839393 0.8836482 0.8816709
: [5,] 0.8715373 0.8762999 0.8791017 0.8783283 0.8762103

** Mean Mins
#+BEGIN_SRC R :results output :session comp.4b.ratio.td.tic :exports both
mean.min<-matrix(0, 5, 5)
mean.min[1,]<-c(mean(dI_I$ratiomin), mean(dI_II$ratiomin), mean(dI_III$ratiomin), mean(dI_IV$ratiomin), mean(dI_V$ratiomin))
mean.min[2,]<-c(mean(dII_I$ratiomin), mean(dII_II$ratiomin), mean(dII_III$ratiomin), mean(dII_IV$ratiomin), mean(dII_V$ratiomin))
mean.min[3,]<-c(mean(dIII_I$ratiomin), mean(dIII_II$ratiomin), mean(dIII_III$ratiomin), mean(dIII_IV$ratiomin), mean(dIII_V$ratiomin))
mean.min[4,]<-c(mean(dIV_I$ratiomin), mean(dIV_II$ratiomin), mean(dIV_III$ratiomin), mean(dIV_IV$ratiomin), mean(dIV_V$ratiomin))
mean.min[5,]<-c(mean(dV_I$ratiomin), mean(dV_II$ratiomin), mean(dV_III$ratiomin), mean(dV_IV$ratiomin), mean(dV_V$ratiomin))
print(mean.min)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 0.8038048 0.8087498 0.8081923 0.8072649 0.8080058
: [2,] 0.8032913 0.8080258 0.8075915 0.8066098 0.8075747
: [3,] 0.8027845 0.8079572 0.8071874 0.8064576 0.8071505
: [4,] 0.8107070 0.8164100 0.8156647 0.8150580 0.8160370
: [5,] 0.8040919 0.8083710 0.8085203 0.8072629 0.8084369

** Mean Maxs
#+BEGIN_SRC R :results output :session comp.4b.ratio.td.tic :exports both
mean.max<-matrix(0, 5, 5)
mean.max[1,]<-c(mean(dI_I$ratiomax), mean(dI_II$ratiomax), mean(dI_III$ratiomax), mean(dI_IV$ratiomax), mean(dI_V$ratiomax))
mean.max[2,]<-c(mean(dII_I$ratiomax), mean(dII_II$ratiomax), mean(dII_III$ratiomax), mean(dII_IV$ratiomax), mean(dII_V$ratiomax))
mean.max[3,]<-c(mean(dIII_I$ratiomax), mean(dIII_II$ratiomax), mean(dIII_III$ratiomax), mean(dIII_IV$ratiomax), mean(dIII_V$ratiomax))
mean.max[4,]<-c(mean(dIV_I$ratiomax), mean(dIV_II$ratiomax), mean(dIV_III$ratiomax), mean(dIV_IV$ratiomax), mean(dIV_V$ratiomax))
mean.max[5,]<-c(mean(dV_I$ratiomax), mean(dV_II$ratiomax), mean(dV_III$ratiomax), mean(dV_IV$ratiomax), mean(dV_V$ratiomax))
print(mean.max)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 0.9333874 0.9455443 0.9594180 0.9537452 0.9195724
: [2,] 0.9450190 0.9532477 0.9714258 0.9662535 0.9279515
: [3,] 0.9084446 0.9147094 0.9268423 0.9300893 0.8978360
: [4,] 0.9125739 0.9230237 0.9356621 0.9332027 0.9015411
: [5,] 0.9414490 0.9486580 0.9633469 0.9636762 0.9266622

** Get the average instruction rate
Having COMP 4b averages and COMP 4c averages, instruction rate is
calculated by:
\begin{equation}
instruction\ rate = mean(\frac{COMP.4c.average}{COMP.4b.average})
\end{equation}

*Instruction Rate for dataset.tic.B.8*

#+BEGIN_SRC R :results output :session rough.estimation.inst.rate :exports both
inst.rate.B.8<-c(mean(d.B.8.4b.4c.I$COMP.4c.avg/d.B.8.4b.4c.I$COMP.4b.avg),
     mean(d.B.8.4b.4c.II$COMP.4c.avg/d.B.8.4b.4c.II$COMP.4b.avg),
     mean(d.B.8.4b.4c.III$COMP.4c.avg/d.B.8.4b.4c.III$COMP.4b.avg),
     mean(d.B.8.4b.4c.IV$COMP.4c.avg/d.B.8.4b.4c.IV$COMP.4b.avg),
     mean(d.B.8.4b.4c.V$COMP.4c.avg/d.B.8.4b.4c.V$COMP.4b.avg))

names(inst.rate.B.8)<-c('dataset1','dataset2','dataset3','dataset4','dataset5')
print(inst.rate.B.8)
#+END_SRC

#+RESULTS:
:   dataset1   dataset2   dataset3   dataset4   dataset5 
: 3529186710 3546078743 3536454601 3541818435 3543297608

*Instruction Rate for dataset.tic.B.16*

#+BEGIN_SRC R :results output :session rough.estimation.inst.rate :exports both
inst.rate.B.16<-c(mean(d.B.16.4b.4c.I$COMP.4c.avg/d.B.16.4b.4c.I$COMP.4b.avg),
     mean(d.B.16.4b.4c.II$COMP.4c.avg/d.B.16.4b.4c.II$COMP.4b.avg),
     mean(d.B.16.4b.4c.III$COMP.4c.avg/d.B.16.4b.4c.III$COMP.4b.avg),
     mean(d.B.16.4b.4c.IV$COMP.4c.avg/d.B.16.4b.4c.IV$COMP.4b.avg),
     mean(d.B.16.4b.4c.V$COMP.4c.avg/d.B.16.4b.4c.V$COMP.4b.avg))

names(inst.rate.B.16)<-c('dataset1','dataset2','dataset3','dataset4','dataset5')
print(inst.rate.B.16)
#+END_SRC

#+RESULTS:
:   dataset1   dataset2   dataset3   dataset4   dataset5 
: 3412133712 3411938727 3402369867 3414700632 3427003883

*Instruction Rate for dataset.tic.C.8*

#+BEGIN_SRC R :results output :session rough.estimation.inst.rate :exports both
inst.rate.C.8<-c(mean(d.C.8.4b.4c.I$COMP.4c.avg/d.C.8.4b.4c.I$COMP.4b.avg),
     mean(d.C.8.4b.4c.II$COMP.4c.avg/d.C.8.4b.4c.II$COMP.4b.avg),
     mean(d.C.8.4b.4c.III$COMP.4c.avg/d.C.8.4b.4c.III$COMP.4b.avg),
     mean(d.C.8.4b.4c.IV$COMP.4c.avg/d.C.8.4b.4c.IV$COMP.4b.avg),
     mean(d.C.8.4b.4c.V$COMP.4c.avg/d.C.8.4b.4c.V$COMP.4b.avg))

names(inst.rate.C.8)<-c('dataset1','dataset2','dataset3','dataset4','dataset5')
print(inst.rate.C.8)
#+END_SRC

#+RESULTS:
:   dataset1   dataset2   dataset3   dataset4   dataset5 
: 3466001975 3465762729 3471493726 3484363137 3469289313

*Instruction Rate for dataset.tic.C.16*

#+BEGIN_SRC R :results output :session rough.estimation.inst.rate :exports both
inst.rate.C.16<-c(mean(d.C.16.4b.4c.I$COMP.4c.avg/d.C.16.4b.4c.I$COMP.4b.avg),
     mean(d.C.16.4b.4c.II$COMP.4c.avg/d.C.16.4b.4c.II$COMP.4b.avg),
     mean(d.C.16.4b.4c.III$COMP.4c.avg/d.C.16.4b.4c.III$COMP.4b.avg),
     mean(d.C.16.4b.4c.IV$COMP.4c.avg/d.C.16.4b.4c.IV$COMP.4b.avg),
     mean(d.C.16.4b.4c.V$COMP.4c.avg/d.C.16.4b.4c.V$COMP.4b.avg))

names(inst.rate.C.16)<-c('dataset1','dataset2','dataset3','dataset4','dataset5')
print(inst.rate.C.16)
#+END_SRC

#+RESULTS:
:   dataset1   dataset2   dataset3   dataset4   dataset5 
: 3388801183 3415770594 3414210891 3419327902 3407884545

** The average
#+BEGIN_SRC R :results output :exports both :session folded.execution
colnames(mean.avg.I)<-c('2', '4', '8', '16', '32')
rownames(mean.avg.I)<-c('I', 'II', 'III')
print(mean.avg.I)

colnames(mean.avg.II)<-c('2', '4', '8', '16', '32')
rownames(mean.avg.II)<-c('I', 'II', 'III')
print(mean.avg.II)

colnames(mean.avg.III)<-c('2', '4', '8', '16', '32')
rownames(mean.avg.III)<-c('I', 'II', 'III')
print(mean.avg.III)
#+END_SRC

#+RESULTS:
#+begin_example
           2        4        8       16       32
I   1.294920 1.801593 3.074491 5.501309 5.654476
II  1.151803 1.668737 3.713880 6.127892 5.431885
III 1.137728 1.717412 3.085137 5.381098 9.408975
           2        4        8       16       32
I   1.133012 1.767449 2.983069 5.384101 5.468562
II  1.113535 1.634939 3.642137 5.881729 5.154058
III 1.121834 1.640258 2.928511 5.104406 9.277681
           2        4        8       16       32
I   1.167226 1.774994 2.992704 5.407993 5.491886
II  1.122771 1.642370 3.608012 5.922191 5.207411
III 1.126435 1.655857 2.956166 5.151927 9.114802
#+end_example

** The minimum
#+BEGIN_SRC R :results output :exports both :session folded.execution
colnames(mean.min.I)<-c('2', '4', '8', '16', '32')
rownames(mean.min.I)<-c('I', 'II', 'III')
print(mean.min.I)

colnames(mean.min.II)<-c('2', '4', '8', '16', '32')
rownames(mean.min.II)<-c('I', 'II', 'III')
print(mean.min.II)

colnames(mean.min.III)<-c('2', '4', '8', '16', '32')
rownames(mean.min.III)<-c('I', 'II', 'III')
print(mean.min.III)
#+END_SRC

#+RESULTS:
#+begin_example
            2        4        8       16       32
I   1.1730068 1.202341 1.733446 2.626703 2.528660
II  1.0095173 1.229796 1.750035 2.771903 2.744994
III 0.9992895 1.306544 1.821200 2.698170 2.921214
           2        4        8       16       32
I   1.028328 1.188971 1.711927 2.574257 2.424619
II  1.016334 1.213377 1.697587 2.556673 2.556258
III 1.006347 1.243142 1.698641 2.464397 2.688905
            2        4        8       16       32
I   1.0441091 1.180548 1.710808 2.592405 2.445299
II  1.0064245 1.207138 1.702581 2.604550 2.599333
III 0.9953297 1.247000 1.714851 2.508310 2.738458
#+end_example

** The maximum
#+BEGIN_SRC R :results output :exports both :session folded.execution
colnames(mean.max.I)<-c('2', '4', '8', '16', '32')
rownames(mean.max.I)<-c('I', 'II', 'III')
print(mean.max.I)

colnames(mean.max.II)<-c('2', '4', '8', '16', '32')
rownames(mean.max.II)<-c('I', 'II', 'III')
print(mean.max.II)

colnames(mean.max.III)<-c('2', '4', '8', '16', '32')
rownames(mean.max.III)<-c('I', 'II', 'III')
print(mean.max.III)
#+END_SRC

#+RESULTS:
#+begin_example
           2        4        8       16       32
I   11.68980 34.10770 38.99242 76.22445 87.04463
II   8.45547 21.94730 44.06379 89.01496 78.67285
III 10.77979 24.37946 31.34041 60.94313 94.74737
            2        4        8       16        32
I   11.771381 36.97037 42.47139 82.76793  94.71667
II   8.741905 23.32944 52.36094 97.63431  87.10268
III 12.862779 26.17173 34.54834 68.21064 115.19983
            2        4        8       16       32
I   11.716900 33.28384 37.75865 71.81477 84.96896
II   8.694936 21.13127 44.98423 85.34437 75.37503
III 10.372431 24.91502 29.73930 56.34469 88.98524
#+end_example

** Mean Averages
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.avg<-matrix(0, 5, 5)
mean.avg[1,]<-c(mean(dI_I$ratioavg), mean(dI_II$ratioavg), mean(dI_III$ratioavg), mean(dI_IV$ratioavg), mean(dI_V$ratioavg))
mean.avg[2,]<-c(mean(dII_I$ratioavg), mean(dII_II$ratioavg), mean(dII_III$ratioavg), mean(dII_IV$ratioavg), mean(dII_V$ratioavg))
mean.avg[3,]<-c(mean(dIII_I$ratioavg), mean(dIII_II$ratioavg), mean(dIII_III$ratioavg), mean(dIII_IV$ratioavg), mean(dIII_V$ratioavg))
mean.avg[4,]<-c(mean(dIV_I$ratioavg), mean(dIV_II$ratioavg), mean(dIV_III$ratioavg), mean(dIV_IV$ratioavg), mean(dIV_V$ratioavg))
mean.avg[5,]<-c(mean(dV_I$ratioavg), mean(dV_II$ratioavg), mean(dV_III$ratioavg), mean(dV_IV$ratioavg), mean(dV_V$ratioavg))
print(mean.avg)
#+END_SRC

#+RESULTS:
:          [,1]     [,2]      [,3]      [,4] [,5]
: [1,] 1.000000 1.031481 1.0342408 1.0260843  Inf
: [2,] 1.020605 1.000000 1.0158230 1.0032474  Inf
: [3,] 1.031365 1.012469 1.0000000 1.0004695  Inf
: [4,] 1.050481 1.025608 1.0261407 1.0000000  Inf
: [5,] 1.020621 1.003280 0.9880754 0.9867983  NaN

** Mean Mins
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.min<-matrix(0, 5, 5)
mean.min[1,]<-c(mean(dI_I$ratiomin), mean(dI_II$ratiomin), mean(dI_III$ratiomin), mean(dI_IV$ratiomin), mean(dI_V$ratiomin))
mean.min[2,]<-c(mean(dII_I$ratiomin), mean(dII_II$ratiomin), mean(dII_III$ratiomin), mean(dII_IV$ratiomin), mean(dII_V$ratiomin))
mean.min[3,]<-c(mean(dIII_I$ratiomin), mean(dIII_II$ratiomin), mean(dIII_III$ratiomin), mean(dIII_IV$ratiomin), mean(dIII_V$ratiomin))
mean.min[4,]<-c(mean(dIV_I$ratiomin), mean(dIV_II$ratiomin), mean(dIV_III$ratiomin), mean(dIV_IV$ratiomin), mean(dIV_V$ratiomin))
mean.min[5,]<-c(mean(dV_I$ratiomin), mean(dV_II$ratiomin), mean(dV_III$ratiomin), mean(dV_IV$ratiomin), mean(dV_V$ratiomin))
print(mean.min)
#+END_SRC

#+RESULTS:
:      [,1] [,2] [,3] [,4] [,5]
: [1,]  NaN  NaN  NaN  NaN  NaN
: [2,]  NaN  NaN  NaN  NaN  NaN
: [3,]  NaN  NaN  NaN  NaN  NaN
: [4,]  NaN  NaN  NaN  NaN  NaN
: [5,]  NaN  NaN  NaN  NaN  NaN

** Mean Maxs
#+BEGIN_SRC R :results output :session comp.4b.ratio.ti.ti :exports both
mean.max<-matrix(0, 5, 5)
mean.max[1,]<-c(mean(dI_I$ratiomax), mean(dI_II$ratiomax), mean(dI_III$ratiomax), mean(dI_IV$ratiomax), mean(dI_V$ratiomax))
mean.max[2,]<-c(mean(dII_I$ratiomax), mean(dII_II$ratiomax), mean(dII_III$ratiomax), mean(dII_IV$ratiomax), mean(dII_V$ratiomax))
mean.max[3,]<-c(mean(dIII_I$ratiomax), mean(dIII_II$ratiomax), mean(dIII_III$ratiomax), mean(dIII_IV$ratiomax), mean(dIII_V$ratiomax))
mean.max[4,]<-c(mean(dIV_I$ratiomax), mean(dIV_II$ratiomax), mean(dIV_III$ratiomax), mean(dIV_IV$ratiomax), mean(dIV_V$ratiomax))
mean.max[5,]<-c(mean(dV_I$ratiomax), mean(dV_II$ratiomax), mean(dV_III$ratiomax), mean(dV_IV$ratiomax), mean(dV_V$ratiomax))
print(mean.max)
#+END_SRC

#+RESULTS:
:          [,1]      [,2]     [,3]     [,4] [,5]
: [1,] 1.000000 1.0907242 1.149522 1.109556  Inf
: [2,] 1.114596 1.0000000 1.207191 1.092779  Inf
: [3,] 1.033333 1.0095771 1.000000 1.036209  Inf
: [4,] 1.062794 1.0308373 1.121275 1.000000  Inf
: [5,] 1.005617 0.9793539 1.026403 1.014937  NaN

